logs/purenfs/fio-randread.log
job-randr: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randr;0;0;2097152;105046;26261;19964;1;6080;25.469044;45.044771;47;19425;1188.788218;508.328727;1.000000%=419;5.000000%=634;10.000000%=765;20.000000%=888;30.000000%=978;40.000000%=1056;50.000000%=1138;60.000000%=1220;70.000000%=1318;80.000000%=1433;90.000000%=1613;95.000000%=1794;99.000000%=2998;99.500000%=3751;99.900000%=4751;99.950000%=5472;99.990000%=17432;0%=0;0%=0;0%=0;190;19437;1214.964065;506.890055;94456;120248;99.847466%;104885.769231;6112.558808;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;4.583479%;17.717778%;467961;0;41;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.07%;1.94%;7.33%;23.52%;64.57%;2.21%;0.32%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randr: (groupid=0, jobs=1): err= 0: pid=14080: Fri Oct  1 08:24:35 2021
  read: IOPS=26.3k, BW=103MiB/s (108MB/s)(2048MiB/19964msec)
    slat (nsec): min=1040, max=6080.6k, avg=25469.04, stdev=45044.77
    clat (usec): min=47, max=19425, avg=1188.79, stdev=508.33
     lat (usec): min=190, max=19437, avg=1214.96, stdev=506.89
    clat percentiles (usec):
     |  1.00th=[  420],  5.00th=[  635], 10.00th=[  766], 20.00th=[  889],
     | 30.00th=[  979], 40.00th=[ 1057], 50.00th=[ 1139], 60.00th=[ 1221],
     | 70.00th=[ 1319], 80.00th=[ 1434], 90.00th=[ 1614], 95.00th=[ 1795],
     | 99.00th=[ 2999], 99.50th=[ 3752], 99.90th=[ 4752], 99.95th=[ 5473],
     | 99.99th=[17433]
   bw (  KiB/s): min=94456, max=120248, per=99.85%, avg=104885.77, stdev=6112.56, samples=39
   iops        : min=23614, max=30062, avg=26221.38, stdev=1528.14, samples=39
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.07%, 500=1.94%, 750=7.33%
  lat (usec)   : 1000=23.52%
  lat (msec)   : 2=64.57%, 4=2.21%, 10=0.32%, 20=0.02%
  cpu          : usr=4.58%, sys=17.72%, ctx=467961, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=103MiB/s (108MB/s), 103MiB/s-103MiB/s (108MB/s-108MB/s), io=2048MiB (2147MB), run=19964-19964msec