logs/purenfs/fio-randwrite.log
job-randw: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randw;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;72987;18246;28733;1;4316;6.208590;13.691954;274;24002;1745.901563;580.206421;1.000000%=1236;5.000000%=1335;10.000000%=1400;20.000000%=1466;30.000000%=1531;40.000000%=1597;50.000000%=1646;60.000000%=1712;70.000000%=1794;80.000000%=1892;90.000000%=2088;95.000000%=2342;99.000000%=3817;99.500000%=5013;99.900000%=6193;99.950000%=8093;99.990000%=20840;0%=0;0%=0;0%=0;339;24005;1752.323480;580.030890;62280;78816;99.909309%;72920.807018;4172.353534;3.490881%;8.690658%;575976;0;10;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.03%;0.06%;86.04%;12.97%;0.85%;0.03%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randw: (groupid=0, jobs=1): err= 0: pid=14069: Fri Oct  1 08:24:10 2021
  write: IOPS=18.2k, BW=71.3MiB/s (74.7MB/s)(2048MiB/28733msec); 0 zone resets
    slat (nsec): min=1169, max=4316.3k, avg=6208.59, stdev=13691.95
    clat (usec): min=274, max=24002, avg=1745.90, stdev=580.21
     lat (usec): min=339, max=24005, avg=1752.32, stdev=580.03
    clat percentiles (usec):
     |  1.00th=[ 1237],  5.00th=[ 1336], 10.00th=[ 1401], 20.00th=[ 1467],
     | 30.00th=[ 1532], 40.00th=[ 1598], 50.00th=[ 1647], 60.00th=[ 1713],
     | 70.00th=[ 1795], 80.00th=[ 1893], 90.00th=[ 2089], 95.00th=[ 2343],
     | 99.00th=[ 3818], 99.50th=[ 5014], 99.90th=[ 6194], 99.95th=[ 8094],
     | 99.99th=[20841]
   bw (  KiB/s): min=62280, max=78816, per=99.91%, avg=72920.81, stdev=4172.35, samples=57
   iops        : min=15570, max=19704, avg=18230.18, stdev=1043.13, samples=57
  lat (usec)   : 500=0.01%, 750=0.03%, 1000=0.06%
  lat (msec)   : 2=86.04%, 4=12.97%, 10=0.85%, 20=0.03%, 50=0.02%
  cpu          : usr=3.49%, sys=8.69%, ctx=575976, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=71.3MiB/s (74.7MB/s), 71.3MiB/s-71.3MiB/s (74.7MB/s-74.7MB/s), io=2048MiB (2147MB), run=28733-28733msec