logs/purenfs/fio-read.log
job-r: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
3;fio-3.16;job-r;0;0;2097152;128904;1007;16269;4;863;38.239302;39.930350;54;212485;3929.453166;7953.084138;1.000000%=440;5.000000%=626;10.000000%=815;20.000000%=1187;30.000000%=1613;40.000000%=3457;50.000000%=4079;60.000000%=4177;70.000000%=4227;80.000000%=4292;90.000000%=4554;95.000000%=6258;99.000000%=18481;99.500000%=19529;99.900000%=208666;99.950000%=210763;99.990000%=212860;0%=0;0%=0;0%=0;353;212542;3968.200551;7952.630829;96256;375824;100.000000%;128976.906250;45701.054607;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.276617%;1.948611%;35936;0;141;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.05%;0.08%;2.04%;5.80%;7.28%;18.21%;12.25%;49.88%;4.06%;0.22%;0.00%;0.12%;0.00%;0.00%;0.00%;0.00%;0.00%

job-r: (groupid=0, jobs=1): err= 0: pid=14060: Fri Oct  1 08:23:36 2021
  read: IOPS=1007, BW=126MiB/s (132MB/s)(2048MiB/16269msec)
    slat (usec): min=4, max=863, avg=38.24, stdev=39.93
    clat (usec): min=54, max=212485, avg=3929.45, stdev=7953.08
     lat (usec): min=353, max=212542, avg=3968.20, stdev=7952.63
    clat percentiles (usec):
     |  1.00th=[   441],  5.00th=[   627], 10.00th=[   816], 20.00th=[  1188],
     | 30.00th=[  1614], 40.00th=[  3458], 50.00th=[  4080], 60.00th=[  4178],
     | 70.00th=[  4228], 80.00th=[  4293], 90.00th=[  4555], 95.00th=[  6259],
     | 99.00th=[ 18482], 99.50th=[ 19530], 99.90th=[208667], 99.95th=[210764],
     | 99.99th=[212861]
   bw (  KiB/s): min=96256, max=375824, per=100.00%, avg=128976.91, stdev=45701.05, samples=32
   iops        : min=  752, max= 2936, avg=1007.62, stdev=357.02, samples=32
  lat (usec)   : 100=0.05%, 250=0.08%, 500=2.04%, 750=5.80%, 1000=7.28%
  lat (msec)   : 2=18.21%, 4=12.25%, 10=49.88%, 20=4.06%, 50=0.22%
  lat (msec)   : 250=0.12%
  cpu          : usr=0.28%, sys=1.95%, ctx=35936, majf=0, minf=141
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=126MiB/s (132MB/s), 126MiB/s-126MiB/s (132MB/s-132MB/s), io=2048MiB (2147MB), run=16269-16269msec