logs/purenfs/fio-write.log
job-w: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
job-w: Laying out IO file (1 file / 2048MiB)
3;fio-3.16;job-w;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;128801;1006;16282;6;1819;19.754383;19.471774;579;250842;3952.451443;5667.908560;1.000000%=872;5.000000%=1105;10.000000%=1269;20.000000%=1777;30.000000%=2932;40.000000%=3850;50.000000%=4079;60.000000%=4177;70.000000%=4292;80.000000%=4423;90.000000%=4816;95.000000%=5734;99.000000%=18219;99.500000%=19005;99.900000%=20578;99.950000%=24248;99.990000%=248512;0%=0;0%=0;0%=0;592;250855;3972.509013;5668.581936;91904;350720;100.000000%;128928.687500;41371.779088;0.780050%;1.897918%;15337;0;12;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.21%;2.61%;19.96%;22.09%;52.34%;2.58%;0.17%;0.00%;0.04%;0.01%;0.00%;0.00%;0.00%;0.00%

job-w: (groupid=0, jobs=1): err= 0: pid=14052: Fri Oct  1 08:23:14 2021
  write: IOPS=1006, BW=126MiB/s (132MB/s)(2048MiB/16282msec); 0 zone resets
    slat (usec): min=6, max=1819, avg=19.75, stdev=19.47
    clat (usec): min=579, max=250842, avg=3952.45, stdev=5667.91
     lat (usec): min=592, max=250855, avg=3972.51, stdev=5668.58
    clat percentiles (usec):
     |  1.00th=[   873],  5.00th=[  1106], 10.00th=[  1270], 20.00th=[  1778],
     | 30.00th=[  2933], 40.00th=[  3851], 50.00th=[  4080], 60.00th=[  4178],
     | 70.00th=[  4293], 80.00th=[  4424], 90.00th=[  4817], 95.00th=[  5735],
     | 99.00th=[ 18220], 99.50th=[ 19006], 99.90th=[ 20579], 99.95th=[ 24249],
     | 99.99th=[248513]
   bw (  KiB/s): min=91904, max=350720, per=100.00%, avg=128928.69, stdev=41371.78, samples=32
   iops        : min=  718, max= 2740, avg=1007.25, stdev=323.22, samples=32
  lat (usec)   : 750=0.21%, 1000=2.61%
  lat (msec)   : 2=19.96%, 4=22.09%, 10=52.34%, 20=2.58%, 50=0.17%
  lat (msec)   : 250=0.04%, 500=0.01%
  cpu          : usr=0.78%, sys=1.90%, ctx=15337, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=126MiB/s (132MB/s), 126MiB/s-126MiB/s (132MB/s-132MB/s), io=2048MiB (2147MB), run=16282-16282msec